In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index= ['Row1','Row2','Row3','Row4','Row5'],columns= ['Column1','Column2','Column3','Column4'])

In [4]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [5]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [6]:
type(df.loc['Row1'])

pandas.core.series.Series

In [7]:
# Accesing the element
# 1. loc   2. iloc
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [8]:
df.iloc[:2,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7

In [9]:
type(df.iloc[:2,:])

pandas.core.frame.DataFrame

In [10]:
df.iloc[:,:1]

      Column1
Row1        0
Row2        4
Row3        8
Row4       12
Row5       16

In [11]:
# Ye dataframe hai kyunki isme row aur column dono likha hai
type(df.iloc[:,:1] )

pandas.core.frame.DataFrame

In [12]:
df.iloc[:,0]

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Column1, dtype: int32

In [13]:
# Ye series hai kyunki sirf ek column dikha rha hai
type(df.iloc[:,0] )

pandas.core.series.Series

In [15]:
# Convert DataFrame into array || it will not show row and column name
df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [16]:
df.iloc[:,:].values.shape

(5, 4)

In [17]:
df['Column1'].unique

<bound method Series.unique of Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Column1, dtype: int32>

In [24]:
# Make a scv file and replace there , using ; still it will run
d = df.to_csv('data1')

In [25]:
# read it now using sep=';' it will read..hm comma ki jagah kuch bhi use kr skte hai..bus sep= kr dena hai
# '''sep=';''' is used when in data instead of , ; is used
naya = pd.read_csv('data1',sep=',')

In [26]:
naya.head()

  Unnamed: 0  Column1  Column2  Column3  Column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       12       13       14       15
4       Row5       16       17       18       19

In [27]:
# Analysing mercedes benz dataset
df1 = pd.read_csv('mercedesbenz.csv')

In [28]:
df1.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [29]:
df1.isnull().sum()

ID      0
y       0
X0      0
X1      0
X2      0
       ..
X380    0
X382    0
X383    0
X384    0
X385    0
Length: 378, dtype: int64

In [30]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [31]:
df1.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [32]:
df1['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
aq     18
am     18
i      18
u      17
aw     16
l      16
ad     14
au     11
k      11
b      11
r      10
as     10
bc      6
ao      4
c       3
aa      2
q       2
ac      1
g       1
ab      1
Name: X0, dtype: int64

In [33]:
# Converts dataframe into ndarray
df1['X0'].values

array(['k', 'k', 'az', ..., 'ak', 'al', 'z'], dtype=object)

In [34]:
# Giving condition in df
df1[df1['y'] > 100]

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
6,24,128.76,al,r,e,f,d,f,h,s,...,0,0,0,0,0,0,0,0,0,0
8,27,108.67,w,s,as,e,d,f,i,h,...,1,0,0,0,0,0,0,0,0,0
9,30,126.99,j,b,aq,c,d,f,a,e,...,0,0,1,0,0,0,0,0,0,0
10,31,102.09,h,r,r,f,d,f,h,p,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4202,8402,123.34,ap,l,s,c,d,aa,d,r,...,0,0,0,0,0,0,0,0,0,0
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [36]:
# CSV - How to read different type of data

In [37]:
from io import StringIO , BytesIO

In [38]:
data = ('col1, col2, col3\n'
           'x,y,1\n'
           'a,b,2\n'
           'f,g,3\n')

In [39]:
data

'col1, col2, col3\nx,y,1\na,b,2\nf,g,3\n'

In [40]:
a = pd.read_csv(StringIO(data))

In [41]:
a

  col1  col2   col3
0    x     y      1
1    a     b      2
2    f     g      3

In [42]:
# Isme 2 column read nhi kr rha
b = pd.read_csv(StringIO(data), usecols=['col1'])

In [43]:
b

  col1
0    x
1    a
2    f

In [44]:
data1 = ('a,b,c,d\n'
         '1,2,3,4\n'
         '5,6,7,8\n'
         '9,10,11\n')

In [147]:
data1

'a,b,c,d\n1,2,3,4\n5,6,7,8\n9,10,11\n'

In [45]:
# We want to keep data type as object
df3 = pd.read_csv(StringIO(data1), dtype=object)

In [46]:
df3.head()

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [47]:
df3.dtypes

a    object
b    object
c    object
d    object
dtype: object

In [48]:
data2 = ('a,b,c,d\n'
         '1,2,3,4\n'
         '5,6,7,8\n'
         '9,10,11,12\n')

In [49]:
# We want to keep data type as int
df4 = pd.read_csv(StringIO(data2), dtype=int)

In [50]:
df4

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [55]:
# We want to set the data type as float
df4 = pd.read_csv(StringIO(data2), dtype=float)

In [56]:
df4

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [57]:
# We want to give different data types to different column
df5 = pd.read_csv(StringIO(data2),dtype={'a' : int, 'b' : float, 'c' : 'Int64'})

In [58]:
df5

   a     b   c   d
0  1   2.0   3   4
1  5   6.0   7   8
2  9  10.0  11  12

In [59]:
# Index col 0,1,2 kuch bhi ho skta hai
df6 = pd.read_csv(StringIO(data2),index_col=0)

In [60]:
df6

    b   c   d
a
1   2   3   4
5   6   7   8
9  10  11  12